app/views/restaurants/add_dish.html.erb

<%= form_with url: restaurant_dishes_path do |form| %>
<%= form.collection_select :dish_id, Dish.all, :id, :name, {include_blank: 'Select a Dish'}, {required: true, class: 'form-control'} %>
---
SELECT "dishes".* FROM "dishes"