app/controllers/dishes_controller.rb

  def create
    @dish = Dish.new(dish_params)
    if @dish.save
---
INSERT INTO "dishes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Egg Roll"], ["created_at", "2022-05-23 11:26:35.207372"], ["updated_at", "2022-05-23 11:26:35.207372"]]

  def add_review
    @restaurant_dish = RestaurantDish.find_by(id: params[:dish_id])
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "restaurant_dishes".* FROM "restaurant_dishes" WHERE "restaurant_dishes"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def review
    @restaurant_dish = RestaurantDish.find_by(id: params[:dish_id])
    @restaurant_dish.reviews.create(comment: params[:comment], user_id: current_user.id)
---
SELECT "restaurant_dishes".* FROM "restaurant_dishes" WHERE "restaurant_dishes"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "reviews" ("comment", "user_id", "created_at", "updated_at", "reviewable_type", "reviewable_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Tasty"], ["user_id", 9], ["created_at", "2022-05-23 11:27:02.973830"], ["updated_at", "2022-05-23 11:27:02.973830"], ["reviewable_type", "RestaurantDish"], ["reviewable_id", 16]]

  def set_dish
    @dish = Dish.find_by(id: params[:id])
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]