app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    @restaurants = Restaurant.search(params[:search])

INSERT INTO "restaurants" ("name", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?)  [["name", "Naman Restaurant"], ["created_at", "2022-05-23 11:20:21.473473"], ["updated_at", "2022-05-23 11:20:21.473473"], ["status", 0]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save

SELECT "dishes".* FROM "dishes" INNER JOIN "restaurant_dishes" ON "dishes"."id" = "restaurant_dishes"."dish_id" WHERE "restaurant_dishes"."restaurant_id" = ?  [["restaurant_id", 6]]
SELECT "restaurant_dishes".* FROM "restaurant_dishes" WHERE "restaurant_dishes"."restaurant_id" = ?  [["restaurant_id", 6]]
---
  def show
    @dishes = RestaurantDish.joins(:dish).search(params[:search]).where(restaurant_id: @restaurant.id)
    @dishes = @dishes.where(dish_id: params[:dish_id]).uniq if params[:dish_id].present?

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def add_dish
    @restaurant = Restaurant.find_by(id: params[:restaurant_id])

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "restaurant_dishes" ("restaurant_id", "dish_id", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["restaurant_id", 7], ["dish_id", 8], ["price", 250.0], ["created_at", "2022-05-23 11:25:14.680180"], ["updated_at", "2022-05-23 11:25:14.680180"]]
---
  def dishes
    @restaurant = Restaurant.find_by(id: params[:restaurant_id])
    @dish = Dish.find_by(id: params[:dish_id])
    RestaurantDish.create(restaurant_id: @restaurant.id, dish_id: @dish.id, price: params[:price])

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "reviews" ("comment", "user_id", "created_at", "updated_at", "reviewable_type", "reviewable_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Nice Restaurant"], ["user_id", 9], ["created_at", "2022-05-23 11:25:28.420808"], ["updated_at", "2022-05-23 11:25:28.420808"], ["reviewable_type", "Restaurant"], ["reviewable_id", 7]]
---
  def review
    @restaurant = Restaurant.find_by(id: params[:restaurant_id])
    @restaurant.reviews.create(comment: params[:comment], user_id: current_user.id)

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_restaurant
    @restaurant = Restaurant.find_by(id: params[:id]) || Restaurant.find_by(id: params[:restaurant_id])