app/models/restaurant_dish.rb

SELECT "restaurant_dishes".* FROM "restaurant_dishes" WHERE "restaurant_dishes"."restaurant_id" = ?  [["restaurant_id", 4]]
---
  def self.to_csv list
    attributes = %w{id name price}
    CSV.generate(encoding: 'UTF-8') do |csv|
      csv << attributes
      list.each do |dish|
        csv << attributes.map{ |attr| dish.send(attr) }