app/jobs/restaurant_status_update_job.rb

  def perform(restaurant, status)
    restaurant.update(status: status)
---
UPDATE "restaurants" SET "updated_at" = ?, "status" = ? WHERE "restaurants"."id" = ?  [["updated_at", "2022-05-23 11:26:19.693418"], ["status", nil], ["id", 7]]